In [104]:
import pandas as pd
import numpy as np
# import matplotlib.pyplot as plt
# import seaborn as sns

In [157]:
df = pd.read_csv('used_car_data.csv')
df.head()

,Brand,Model,Model_year,Transmission,Engine_size(cc),Drivetrain,Fuel_type,Colour,Lot_no,Kilometer,Status,Price
0,Chevrolet,aveo,2009.0,Manual,1150.0,2WD,Petrol,golden,6.0,200.0,USED,Rs. 975000
1,Chevrolet,captiva,2015.0,Automatic,2000.0,4WD,Diesel,Grey,8.0,100.0,USED,Rs. 3000000
2,Chevrolet,aveo,2009.0,Manual,1150.0,2WD,Petrol,golden,6.0,42000.0,USED,Rs. 975000
3,Chevrolet,captiva,2010.0,Automatic,2000.0,4WD,Diesel,Grey,8.0,51000.0,USED,Rs. 3000000
4,Chevrolet,spark,2012.0,Manual,1000.0,2WD,Petrol,Sky Blue,9.0,38000.0,USED,Rs. 1000000

In [158]:
df.shape

(2217, 12)

In [159]:
df['Status'].unique()

array(['USED', nan], dtype=object)

#####  Since we know that the vehicles are used vehicle so this column 'Status' has no use.

In [160]:
df.drop(['Status'], axis='columns', inplace=True)

In [161]:
df.head()

,Brand,Model,Model_year,Transmission,Engine_size(cc),Drivetrain,Fuel_type,Colour,Lot_no,Kilometer,Price
0,Chevrolet,aveo,2009.0,Manual,1150.0,2WD,Petrol,golden,6.0,200.0,Rs. 975000
1,Chevrolet,captiva,2015.0,Automatic,2000.0,4WD,Diesel,Grey,8.0,100.0,Rs. 3000000
2,Chevrolet,aveo,2009.0,Manual,1150.0,2WD,Petrol,golden,6.0,42000.0,Rs. 975000
3,Chevrolet,captiva,2010.0,Automatic,2000.0,4WD,Diesel,Grey,8.0,51000.0,Rs. 3000000
4,Chevrolet,spark,2012.0,Manual,1000.0,2WD,Petrol,Sky Blue,9.0,38000.0,Rs. 1000000

In [162]:
df.isnull().sum()

Brand              316
Model              316
Model_year         316
Transmission       316
Engine_size(cc)    316
Drivetrain         316
Fuel_type          316
Colour             316
Lot_no             316
Kilometer          316
Price              316
dtype: int64

In [163]:
cols=['Brand','Model','Model_year','Transmission','Engine_size(cc)','Drivetrain','Fuel_type','Colour','Lot_no','Kilometer','Price']
cols

['Brand',
 'Model',
 'Model_year',
 'Transmission',
 'Engine_size(cc)',
 'Drivetrain',
 'Fuel_type',
 'Colour',
 'Lot_no',
 'Kilometer',
 'Price']

###### There are equal no of missing values in all columns of the dataset. But when I see the dataset I found that these are not missing values but empty rows thatswhy all mising values are equal so we remove the these empty rows.

In [164]:
df.replace('',np.nan, inplace=True)
df.tail()

,Brand,Model,Model_year,Transmission,Engine_size(cc),Drivetrain,Fuel_type,Colour,Lot_no,Kilometer,Price
2212,Volkswagen,passat,2010.0,Manual,1800.0,2WD,Petrol,black,8.0,11000.0,Rs. 5800000
2213,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2214,Volkswagen,tiguan,2010.0,Manual,2000.0,2WD,Petrol,India blue,8.0,25000.0,Rs. 4900000
2215,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2216,Volkswagen,vento,2012.0,Manual,1600.0,2WD,Diesel,Silver,11.0,14000.0,Rs. 3555555

In [165]:
df.dropna(subset=cols,inplace=True)
df.tail()

,Brand,Model,Model_year,Transmission,Engine_size(cc),Drivetrain,Fuel_type,Colour,Lot_no,Kilometer,Price
2210,Volkswagen,polo,2013.0,Manual,1600.0,2WD,Petrol,Silver,11.0,6300.0,Rs. 2700000
2211,Volkswagen,beetle,2010.0,Manual,1595.0,2WD,Petrol,Maroon Red,8.0,19000.0,Rs. 3950000
2212,Volkswagen,passat,2010.0,Manual,1800.0,2WD,Petrol,black,8.0,11000.0,Rs. 5800000
2214,Volkswagen,tiguan,2010.0,Manual,2000.0,2WD,Petrol,India blue,8.0,25000.0,Rs. 4900000
2216,Volkswagen,vento,2012.0,Manual,1600.0,2WD,Diesel,Silver,11.0,14000.0,Rs. 3555555

In [166]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1901 entries, 0 to 2216
Data columns (total 11 columns):
Brand              1901 non-null object
Model              1901 non-null object
Model_year         1901 non-null float64
Transmission       1901 non-null object
Engine_size(cc)    1901 non-null float64
Drivetrain         1901 non-null object
Fuel_type          1901 non-null object
Colour             1901 non-null object
Lot_no             1901 non-null float64
Kilometer          1901 non-null float64
Price              1901 non-null object
dtypes: float64(4), object(7)
memory usage: 178.2+ KB

In [167]:
df['Brand'].unique()

array(['Chevrolet', 'Fiat', 'Ford', 'Honda', 'Hyundai', 'Kia',
       'Land Rover', 'Mahindra', 'Maruti Suzuki', 'Nissan', 'Skoda',
       'Tata', 'Toyota', 'Volkswagen'], dtype=object)

In [168]:
df['Model'].unique()

array(['aveo', 'captiva', 'spark', 'beat', 'u-va', 'uva', 'sedan',
       'avventura', 'punto', 'linea', 'figo', 'palio', 'ecosport',
       'titanium', 'fiesta', 'ranger', 'cr-v', 'city', 'jazz', 'brio',
       'civic', 'crv', 'accent', 'i10', 'santro', 'i20', 'getz', 'asta',
       'tucson', 'eon', 'creta', 'elite', 'elantra', 'sonata', 'sephia',
       'sportage', 'picanto', 'rio', 'soul', 'carens', 'cerato',
       'freelander', 'discovery', 'defender', 'bolero', 'Kuv', 'scorpio',
       'swift', 'alto-800', 'celerio', 'alto-LXI', 'Omni', '800', 'eeco',
       'astar', 'alto', 'dzire', 'a-star', 'saloon', 'sunny', 'tiida',
       'fabia', 'laura', 'rapid', 'superb', 'octavia', 'sumo', 'safari',
       'ace', 'indica', 'bolt', 'strome', 'nano', 'grande', 'manza',
       'venture', 'indigo', 'corolla', 'fortuner', 'hilux', 'cruiser',
       'etios', 'echo', 'avanza', 'camry', 'corona', 'prado', 'hiace',
       'polo', 'tiguan', 'beetle', 'vento', 'touareg', 'passat'],
      dtype=object)

###### For categorical variables which has only 2 values can be converted to 0 and 1 .

In [169]:
df['Transmission'].unique()

array([' Manual', ' Automatic'], dtype=object)

In [170]:
df['Transmission']=df['Transmission'].replace([' Manual',' Automatic'], [0,1])

In [171]:
df['Transmission'].head()

0    0
1    1
2    0
3    1
4    0
Name: Transmission, dtype: int64

In [172]:
df['Transmission']=df['Transmission'].astype(int)

In [173]:
df['Drivetrain'].unique()

array([' 2WD', ' 4WD'], dtype=object)

In [174]:
df['Drivetrain']=df['Drivetrain'].replace([' 2WD',' 4WD'], [0,1])

In [175]:
df['Drivetrain'].head()

0    0
1    1
2    0
3    1
4    0
Name: Drivetrain, dtype: int64

In [176]:
df['Fuel_type'].unique()

array([' Petrol', ' Diesel'], dtype=object)

In [177]:
df['Fuel_type']=df['Fuel_type'].replace([' Petrol', ' Diesel'],[0,1])

In [178]:
df['Fuel_type'].head()

0    0
1    1
2    0
3    1
4    0
Name: Fuel_type, dtype: int64

In [179]:
df['Colour'].unique()

array([' golden', ' Grey', ' Sky Blue ', ' Green', ' Red/Maroon',
       ' Maroon', ' royal black', ' metalic sky blue', ' Golden Silver ',
       ' Red', ' Lilene Beige', ' White', ' Bue', ' Light Golden',
       ' Silver', ' Sky blue', ' golden silver', ' silver', ' Metallic',
       ' Golden', ' Gray', ' Black', ' WHITE', ' Platinum Metallic',
       ' Dark Gray', ' Blue', ' black', ' Chocolate Grey',
       ' Caviar Black ', ' SILVER', ' white ', '  Pearl Silver',
       ' orange ', ' Velvet Red', ' Beige', ' sky blue', ' Caviar Black',
       ' Lenin Beige', ' Sandive grey', ' Silver ', ' Cream Blue',
       ' Off white ', ' dark grey', ' maroon(red)', ' White ',
       ' Golden Grey', ' Moondust Silver', ' Mars Red', ' smoke grey',
       ' White Gold', ' Orange', ' Chilly Silver ', ' grey', ' white',
       ' Sea greay', ' Space gray', ' FROGEN WHITE', ' Paprika Red',
       ' Chill', ' Sea gray ', ' Sea Grey', ' Siver', ' Diamond white',
       ' Dark grey', ' silky silver', ' Light Green', ' milky white',
       ' Beautiful White', ' squeeze ', ' Gray ', ' Metalic Grey',
       ' Paprika red ', ' red', ' gray', ' Diamond White',
       ' Pearl silver ', ' diamond', ' Paprika red', ' Red ',
       ' Colorado Red', ' D.White', ' Squeeze ', ' Silky silver ',
       ' SQUEEZE (GREEN)', ' Kinetic blue', ' Smoke', ' Sea Gray',
       ' Panther Black', ' maroon red', ' Maroon Red', ' black ',
       ' Navy Green', ' Navy green', ' Bluish Silver', ' Baidge',
       ' sliver', ' Light Blue', ' Blue ', ' Dark Grey', ' maroon',
       ' tafeta white', ' mettalic grey', ' Metallic silver', ' Brown',
       ' yellow', ' Grey ', ' light green', ' blue', ' red & black',
       ' Real Earth', ' Golden ', ' Sky Blue', ' Maroon red', ' GREY',
       ' Carbon grey', ' Silky Brown ', ' Sleek silver',
       ' Metalic Silver', ' Blushing Red', ' Maroon ', ' Pearl White',
       ' Royal blue', ' Dark Grey Stardust', ' Champion Gold',
       ' Standard Black', ' Blushing red', ' BIue', ' SiIver',
       ' sky Blue', ' Aqua Silver', ' Marhoon', ' Crystal White',
       ' chympigyan gold', ' Whiskey BIue', ' light blue',
       ' Sleek Silver', ' Metallic Blue', ' champion gold', ' Stardust',
       ' SIVER', ' Amber grey', ' Wine Red', ' Bright Silver',
       ' Light Golden ', ' Sampion Gold', ' Black grey ', ' Silk Silver',
       ' gray ', ' silver green ', ' silver ', ' Light Glden',
       '  Sleek Silver', ' `light golden', ' Metalic ', ' golden ',
       ' Oyster grey', ' Metalic Blue', ' silver,green', ' Sliver',
       ' light golden', ' golden orange ', ' Black ', ' Grea',
       ' marron red', ' Shampion Gold', ' Silk silver', ' Midnight Gray',
       ' snow white', ' Brick red', ' Midnight grey', ' Sparkle Blue',
       ' champagyan gold', ' silver golden', ' Siliver', ' light gold',
       ' Marron', ' Forest Dew', ' Line Blue', ' Gold', ' shympain Gold',
       ' Milky white ', ' Blue sky ', ' sampion gold', ' BLUE',
       ' Whisky Blue', ' GRAY', ' teal blue', ' yellow ', ' siver',
       ' silk silver', ' Carbon Grey', ' DARK GREEN', ' blue sky',
       ' Light golden', ' blur', ' Red maron', ' Blue sky', ' silvar',
       ' real earth', ' CARBON GREY', ' maroon ', ' blue ',
       ' standard red', ' light grey metalic', ' dark blue ', ' BG BLACK',
       ' grenyet red', ' LIGHT BLUE', ' RED', '  silver',
       ' Maroon metallic', ' Silky Silver', ' Creamy white',
       ' Silky silver', ' Light Gold', ' Troquoise Blue', ' Gray &Black',
       ' Creamy White', ' skyblue', ' berry red', ' Apline Blue',
       ' ldark skyblue', ' light blue  ', ' Champen Gold',
       ' Sampain Gold', ' Cream', ' Mid nite grey', ' Dark Blue',
       ' light blue ', ' Teal Green', ' Metalic Red', ' Metallic Silver',
       ' Blue Metalic', ' PURPLE', ' Vanilla sake', ' Diamond Blue',
       ' Silver Metallic Smoke Grey ', ' Metalic Black',
       ' Titanium Silver', ' brown ', ' vintage blue', ' Mineral silver',
       ' Bright silver', ' Sand Track', ' SIlver Metallic Grey',
       ' Titanium ', ' Cafe Mocha', ' Royal black', ' MINARAL SILVER',
       ' metalic grey', ' BLACK', ' Metallic Bronze', ' coffee mocha',
       ' titanium silver ', ' blue metalic', ' Light Sky Blue',
       ' Chocolate', ' green', ' Metallic Grey', ' Royal Blue', ' blue,',
       ' Read', ' LIGHT GREY', ' Sea Green', ' Army', ' Dark red',
       ' mist silver', ' mist silver ', ' Army colour', ' coat red',
       ' black and silver', ' Java Brawn', ' Rocky Beige', ' Mist Silver',
       ' designer grey', ' light Green', ' granite red', ' creami white',
       ' silky silver ', ' Chocolate Brown ', ' Dark Red', ' alpine blue',
       ' Desert brown', ' artic white', ' Parasite Blue', ' Dazzling Red',
       ' golden yellow', ' DARK GREY', ' Silver golden', ' Purple Blue',
       ' cayenne orange', ' Metallic steel ', ' green ', ' purple',
       ' sillky siliver', ' dusky brown', ' orange', ' azure grey',
       ' Healing Green', ' GREEN', ' digital blue', ' Maroon/Orange',
       ' aqua blue', ' red ', ' Copper Red ', ' METALLIC SILKY SILVER',
       ' Dark Blue ', ' pearl blue', ' metallic blue', ' Gret',
       ' healing green', ' Metalic Orange', ' Sunlight copper ',
       ' Silvery Blue', ' yelleow ', ' dark orange', ' golden brown',
       ' navy blue', ' kaleji red', ' Silver Gold', ' Blue And White',
       ' Shining White', ' Wine red', ' Arctic Silver', ' Marrone ',
       ' Golden brown', ' Golden silver ', ' Yellowish Silver',
       ' Capachine Baige', ' Chocolate colour', ' Light brown',
       ' Deep Black', ' Silver Grey', ' red/maroon', ' sky blue white',
       ' Cycus Grey', ' sea grey', ' Silver white', ' Res', ' Aqua green',
       ' Urban bronze', ' Yellow', ' Sardania Red', ' Burgandy royal',
       ' tyrine wine', ' Aqua Green', ' KARBON GREY', ' metallic silver',
       ' Carbon Black', ' Maroon Orange', ' Smokey Grey', ' walnut green',
       ' marin blue', ' Purple', ' matt black', ' Metalic Green',
       ' metallic silver ', ' SILVER METALIC', ' Dark Maroon',
       ' light blue metalic', ' Metallic Gray',
       ' Cocktail of golden & black', ' brown', ' Dark green', ' whit',
       ' Grey metallic', ' sleek silver', ' Giolden', ' Grey Metallic',
       ' Silver blue', ' toffee brown', ' Golden Beige', ' Red Flash',
       ' RID GREEN', ' Dark meta lick blue', ' India blue'], dtype=object)

##### Actually color is personal preference and  has no role in determining the price of the car so I am removing the 'Colour' column

In [180]:
df.drop(['Colour'],axis='columns',inplace=True)

In [181]:
df.isnull().sum()

Brand              0
Model              0
Model_year         0
Transmission       0
Engine_size(cc)    0
Drivetrain         0
Fuel_type          0
Lot_no             0
Kilometer          0
Price              0
dtype: int64

###### Each brand has its different models so instead of two separate features we can change 'Brand' and 'Model' to one single feature.

In [182]:
df['Brand']=df['Brand']+df['Model']

In [183]:
df = df.drop(['Model'], axis = 1)

In [184]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1901 entries, 0 to 2216
Data columns (total 9 columns):
Brand              1901 non-null object
Model_year         1901 non-null float64
Transmission       1901 non-null int32
Engine_size(cc)    1901 non-null float64
Drivetrain         1901 non-null int64
Fuel_type          1901 non-null int64
Lot_no             1901 non-null float64
Kilometer          1901 non-null float64
Price              1901 non-null object
dtypes: float64(4), int32(1), int64(2), object(2)
memory usage: 141.1+ KB

###### Price column has 'Rs' in every row so we remove it

In [185]:
df['Price'] = (df['Price'].str.strip('Rs. ').astype(int))
df['Price'].head()

0     975000
1    3000000
2     975000
3    3000000
4    1000000
Name: Price, dtype: int32

In [186]:
df[['Transmission','Kilometer','Price']] = df[['Transmission','Kilometer','Price']].apply(pd.to_numeric)
df.dtypes

Brand               object
Model_year         float64
Transmission         int32
Engine_size(cc)    float64
Drivetrain           int64
Fuel_type            int64
Lot_no             float64
Kilometer          float64
Price                int32
dtype: object

###### Model is in year date form . lets keep it in no of years (2021-year_date)

In [188]:
df.loc[:, "Model_year"] = df["Model_year"].apply(lambda x: 2021-x) # Model_year is in year(date) form so converting it into no of year form.
df.head()

,Brand,Model_year,Transmission,Engine_size(cc),Drivetrain,Fuel_type,Lot_no,Kilometer,Price
0,Chevroletaveo,12.0,0,1150.0,0,0,6.0,200.0,975000
1,Chevroletcaptiva,6.0,1,2000.0,1,1,8.0,100.0,3000000
2,Chevroletaveo,12.0,0,1150.0,0,0,6.0,42000.0,975000
3,Chevroletcaptiva,11.0,1,2000.0,1,1,8.0,51000.0,3000000
4,Chevroletspark,9.0,0,1000.0,0,0,9.0,38000.0,1000000

In [189]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1901 entries, 0 to 2216
Data columns (total 9 columns):
Brand              1901 non-null object
Model_year         1901 non-null float64
Transmission       1901 non-null int32
Engine_size(cc)    1901 non-null float64
Drivetrain         1901 non-null int64
Fuel_type          1901 non-null int64
Lot_no             1901 non-null float64
Kilometer          1901 non-null float64
Price              1901 non-null int32
dtypes: float64(4), int32(2), int64(2), object(1)
memory usage: 133.7+ KB

In [190]:
df['Model_year'] = df['Model_year'].astype('int64')
df['Transmission'] = df['Transmission'].astype('int64')
df['Engine_size(cc)'] = df['Engine_size(cc)'].astype('int64')
df['Drivetrain'] = df['Drivetrain'].astype('int64')
df['Fuel_type'] = df['Fuel_type'].astype('int64')
df['Lot_no'] = df['Lot_no'].astype('int64')
df['Kilometer'] = df['Kilometer'].astype('int64')
df['Price'] = df['Price'].astype('int64')

In [191]:
df.to_csv('cleaned_used_car_data.csv', index=False)

In [77]:
# finding the top 20 categories
df.Brand.value_counts().sort_values(ascending=False).head(22)

Hyundaii10               214
Hyundaisantro            194
Maruti Suzukiswift       121
Fordfigo                  90
Maruti Suzukialto-800     86
Hyundaiasta               80
Maruti Suzukialto-LXI     72
Mahindrascorpio           66
Hyundaitucson             54
Kiasportage               50
Toyotacorolla             48
Kiapicanto                46
Tataindica                45
Volkswagenpolo            41
Hyundaii20                39
Hondacity                 33
Mahindrabolero            30
Hyundaieon                29
Chevroletaveo             29
Fordtitanium              27
Hyundaigetz               24
Hyundaiaccent             22
Name: Brand, dtype: int64

In [78]:
# make list with top 10 variables
top_10 = [x for x in df.Brand.value_counts().sort_values(ascending=False).head(10).index]
top_10

['Hyundaii10',
 'Hyundaisantro',
 'Maruti Suzukiswift',
 'Fordfigo',
 'Maruti Suzukialto-800',
 'Hyundaiasta',
 'Maruti Suzukialto-LXI',
 'Mahindrascorpio',
 'Hyundaitucson',
 'Kiasportage']

###### Top 10 car model which is maximum sold as a second hand car